import UIKit

// Ціле десяткове число 12 з мінімально необхідною розрядною сіткою
let valueInt8: Int8 = 12

//Ціле десяткове число -100 з мінімально необхідною розрядною сіткою
let value: Int8 = -100

//Мінімальне десяткове значення числа, яке знаходиться у межах 16-розрядної сітки.
Int16.min

//Максимальне десяткове значення числа, яке знаходиться у межах 64-розрядної сітки.
UInt64.max

//Число з плаваючою крапкою 10,235.34 з мінімально необхідною розрядною сіткою.
let namber: Float16 = 10235.34

// Символ “а”.
let char: Character = "a"

//Рядок “Hello World”.
let hello: String = "Hello World"

//Істина.
let isTrue: Bool = true

//Число 12 та його рядкове представлення “twelve”.
let tuples = (12, "twelve")
let dictionary: [Int: String] = [12: "twelve"]
